#language:ru

  Функционал: тест
    Сценарий: тест
      Когда закрыли баннер
      Когда выбран пункт меню "Электроника"
      Когда выбрана категория "Телефоны"
      Когда выбран производитель "Apple,Lenovo"
      Когда установлена цена "50000"
      Когда выполнено нажитие на кнопку применить
      Когда добавлен первый элемент в корзину
      Когда выполнено нажатие на кнопку корзина
      Когда выполнена проверка есть ли элемент в корзине
      Когда выполнено нажатие на кнопку удалить все
      Тогда заголовок страницы - "Корзина пуста"